import {
  InfoText,
  InfoWrap,
  InfoTitle,
  QuestionIcon,
} from '../../SingInPage.styled';

export const Info = () => {
  return (
    <>
      <QuestionIcon />

      <InfoWrap>
        <InfoTitle> Інформація щодо користування: </InfoTitle>
        <InfoText>
          Після регестрації Адміністратор компанії може додавати
          <b> до 5 безкоштовних акаунтів </b> співробітників.
        </InfoText>

        <InfoText>
          Якщо Ви є співробітником компанії і ваша компанія вже загеєстрована на
          нашому ресурсі, зверніться до вашого адміністратора для отримання
          логіну та паролю для входу у систему.
        </InfoText>

        <InfoText>
          Якщо Ви є співробітником компанії і забули/загубили логін або пароль ,
          зверніться до вашого Адміністратор компанії.
        </InfoText>

        <hr />
        <InfoTitle> Зверніться у нашу службу підтримки якщо: </InfoTitle>

        <InfoText>
          після реєстрації вам не приходить номер підтвердження на електронну
          скриньку;
        </InfoText>

        <InfoText>
          хочете протестувати нашу систему <b> без реєстрації</b>;
        </InfoText>

        <InfoText>
          забули/загубили логін або пароль Адміністратора компанії;
        </InfoText>
      </InfoWrap>
    </>
  );
};
